DataProcessors/ВКонтакте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВКонтакте</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>access_token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>owner_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>message</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>file_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>post_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>start_comment_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>domain</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>filter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>post_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ВКонтакте/Forms/ЧтениеЗаписейСоСтены/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.access_token = РаботаССайтомВКонтакте.access_tokenПолучить();
	Объект.owner_id = РаботаССайтомВКонтакте.ПолучитьЗначениеПараметра("owner_id");
	Объект.domain = РаботаССайтомВКонтакте.ПолучитьЗначениеПараметра("domain");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Объект.file_name = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЗаписи(Команда)
	
	Попытка
		
		МассивКомментариев = РаботаССайтомВКонтакте.ПрочитатьЗаписиСоСтены(Объект.access_token, Объект.owner_id, Объект.domain,, Объект.count, Объект.filter,
			?(extended, "1", ""), ?(extended, fields, "")); // дополнительные поля
		
		Профили = Новый Соответствие;
		Если ТипЗнч(МассивКомментариев) = Тип("Структура") Тогда
			Профили = МассивКомментариев.Профили;
			МассивКомментариев = МассивКомментариев.Комментарии;
		КонецЕсли;
		
		Объект.Комментарии.Очистить();
		Если МассивКомментариев.Количество() > 0 Тогда
			ЗаполнитьКомментарииНаСервере(МассивКомментариев, Профили);
		КонецЕсли;
		
	Исключение
		Сообщить("Ошибка чтения записей со стены: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомментарииНаСервере(МассивКомментариев, Профили)
	
	// создаём реквизиты
	ДобавляемыеРеквизиты = Новый Массив;
	СтруктураРеквизитов = МассивКомментариев[0];
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ТипДобавляемогоЗначения = ?(КлючИЗначение.Значение = Неопределено, "Строка", Строка(ТипЗнч(КлючИЗначение.Значение)));
		Если КлючИЗначение.Ключ = "date" Тогда ТипДобавляемогоЗначения = "Дата"; КонецЕсли;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(КлючИЗначение.Ключ, Новый ОписаниеТипов(ТипДобавляемогоЗначения), "Объект.Комментарии"));
	КонецЦикла;
	
	// пакетное создание и удаление
	Попытка
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		// создаём элементы
		Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
			Элемент = Элементы.Добавить(КлючИЗначение.Ключ, Тип("ПолеФормы"), Элементы.Комментарии); 
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ПутьКДанным = "Объект.Комментарии." + КлючИЗначение.Ключ;
		КонецЦикла;
	Исключение КонецПопытки;
	
	Для Каждого СтруктураКомментарий Из МассивКомментариев Цикл
		НоваяСтрокаТЧ = Объект.Комментарии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтруктураКомментарий);
		Если СтруктураКомментарий.Свойство("date") Тогда
			НоваяСтрокаТЧ.date = МестноеВремя(РаботаСВнешнимВебСервером.ПолучитьДатуВремяИзUnixTime(СтруктураКомментарий.date));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбращения(Команда)
	
	ЗаписатьОбращенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбращенияНаСервере()
	
	ИсточникОбращения = Справочники.ИсточникиОбращений.ВКонтакте;
	СсылкаНаСайт = "https://vk.com/" + Объект.domain + "?w=wall" + Объект.owner_id + "_";
	СмещениеВЧасах = РаботаССайтомВКонтакте.ПолучитьЗначениеПараметра("СмещениеВЧасах");
	СмещениеВСекундах = ?(СмещениеВЧасах = Неопределено, Неопределено, СмещениеВЧасах * 3600);
	
	ПоследняяЗаписьСоСтены = РаботаССайтомВКонтакте.ПолучитьЗначениеПараметра("ПоследняяЗаписьСоСтены");
	ПоследняяЗаписьСоСтены = ?(ТипЗнч(ПоследняяЗаписьСоСтены) = Тип("Число"), ПоследняяЗаписьСоСтены, 0);
	
	Попытка
		МассивКомментариев = РаботаССайтомВКонтакте.ПрочитатьЗаписиСоСтены(Объект.access_token, Объект.owner_id, Объект.domain,, Объект.count, Объект.filter,
			?(extended, "1", ""), ?(extended, fields, "")); // дополнительные поля
		
		Профили = Новый Соответствие;
		Если ТипЗнч(МассивКомментариев) = Тип("Структура") Тогда
			Профили = МассивКомментариев.Профили;
			МассивКомментариев = МассивКомментариев.Комментарии;
		КонецЕсли;
		
		// считываем записи с конца
		КвоЗаписей = МассивКомментариев.ВГраница();
		Если КвоЗаписей = -1 Тогда Возврат; КонецЕсли;
		
		Для Сч = 0 По КвоЗаписей Цикл
			
			СтруктураКомментарий = МассивКомментариев[КвоЗаписей - Сч];
			НомерЗаписиСоСтены = Число(СтруктураКомментарий.id);
			Если НомерЗаписиСоСтены <= ПоследняяЗаписьСоСтены Тогда Продолжить; КонецЕсли;
			
			Запись = РегистрыСведений.ОбращенияПокупателей.СоздатьМенеджерЗаписи();
			Запись.GUID_Загрузки = Новый УникальныйИдентификатор();
			Запись.ДатаДок = РаботаСВнешнимВебСервером.ПолучитьДатуВремяИзUnixTime(СтруктураКомментарий.date);
			Запись.ДатаДок = ?(СмещениеВСекундах = Неопределено, МестноеВремя(Запись.ДатаДок), Запись.ДатаДок + СмещениеВСекундах);
			Запись.ИсточникОбращения = ИсточникОбращения;
			
			Запись.Примечание = СокрЛП(СтрЗаменить(СтруктураКомментарий.text, "<br>", Символы.ПС));
			Запись.СсылкаНаСайт = СсылкаНаСайт + СтруктураКомментарий.id + "&from_id=" + СтруктураКомментарий.from_id;
			
			ФИО_Покупателя = Профили.Получить(СтруктураКомментарий.from_id);
			Если ФИО_Покупателя <> Неопределено Тогда
				Запись.ФИО_Покупателя = ФИО_Покупателя;
			КонецЕсли;
			
			Запись.id_OK = РегистрыСведений.ОбращенияПокупателей.ПолучитьСледующийid_OK();
			Запись.Записать();
			
			РаботаССайтомВКонтакте.УстановитьЗначениеПараметра("ПоследняяЗаписьСоСтены", НомерЗаписиСоСтены);
			
		КонецЦикла;
		
	Исключение
		Сообщить("Ошибка чтения записей со стены: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
